import React from 'react';
import './about.css';
import MyLogo from '../../assets/AboutMeLogo.png';

// عنصر About هو القسم الذي يعرض معلومات عن المستخدم
const About = () => {
  return (
    <section id='about'>
      {/* عنوان القسم */}
      <h5>تعرف علي</h5>
      <h2>رحلتي</h2>

      <div className='container about__container'>
        <div className='about__me'>
          <div className="about__me-image">
            {/* عرض صورة المستخدم */}
            <img src={MyLogo} alt='صورة تعريفية' />
          </div>
        </div>

        <div className="about__content">
          {/* نص يصف المستخدم واهتماماته */}
          <p>.أبجد هوز حطى كلمن هوى ، إجراءات المراقبة المعززة. التوازن ، الاحتياجات الأكبر لرفض المتعة ، من الصعب جدًا إجراء قطع سلس! عبث أولئك الذين يرفضون محبة المبارك شيء لا تتبعه الأخوات؟</p>
          <p>.أبجد هوز حطى كلمن هوى ، إجراءات المراقبة المعززة. التوازن ، الاحتياجات الأكبر لرفض المتعة ، من الصعب جدًا إجراء قطع سلس! عبث أولئك الذين يرفضون محبة المبارك شيء لا تتبعه الأخوات؟</p>
          <p>.أبجد هوز حطى كلمن هوى ، إجراءات المراقبة المعززة. التوازن ، الاحتياجات الأكبر لرفض المتعة ، من الصعب جدًا إجراء قطع سلس! عبث أولئك الذين يرفضون محبة المبارك شيء لا تتبعه الأخوات؟</p>
          <p>.أبجد هوز حطى كلمن هوى ، إجراءات المراقبة المعززة. التوازن ، الاحتياجات الأكبر لرفض المتعة ، من الصعب جدًا إجراء قطع سلس! عبث أولئك الذين يرفضون محبة المبارك شيء لا تتبعه الأخوات؟</p>

          {/* زر الاتصال */}
          <a href='#contact' className='btn btn-primary'>لنـتحـدث</a>
        </div>
      </div>
    </section>
  );
}

export default About;