import React from 'react';
import './about.css';
import MyLogo from '../../assets/AboutMeLogo.png';
import { Image } from 'react-bootstrap';

const About = () => {
  return (
    <section id='about'>
      <h5>تعرف علي</h5>
      <h2>عني</h2>

      <div className='container about__container'>
        <div className='about__me'>
          <div className="about__me-image">
            <Image src={MyLogo} alt='صورة عني' />
          </div>
        </div>

        <div className="about__content">

          <p>اسمح لي أن أعرف نفسي، ابتداءً من بداية رحلتي التعليمية حتى أحدث تجربة عمل لدي في شركة سالني تك. بدأت مسيرتي الجامعية في تخصص الفيزياء لمدة ثلاث سنوات. ومع ذلك، لم أشعر بالرضا في هذا التخصص، لذا قررت الانسحاب من الجامعة ومتابعة دراستي في علوم الحاسوب.</p>
          <p>كانت خلال دراستي العلوم الحاسوبية أثناء التحصيل المهني حين اكتشفت شغفي بالبرمجة، وبشكل خاص عند مواجهة أخطاء في الشفرة البرمجية. وجدت الفرح في حل المشكلات وتحليلها ثم حلها. وهذا دفعني لاتخاذ قرار متابعة درجة البكالوريوس بعد تخرجي من جامعة نجران. في ذلك الوقت، كنت يائسًا للعثور على وظيفة، وفي ذلك الوقت اطلعت على إعلان لأكاديمية تويق 1000.</p>
          <p>اخترت مسار JavaScript، وتبين أنه تجربة فريدة لي. نمت حبي لتطوير الويب بشكل أقوى، وخضت ثلاثة أشهر من التدريب المكثف. بعد ذلك، كنت محظوظًا بتوظيفي في شركة سالني تك. على الرغم من أن دوري لم يتماشى مباشرة مع تجربتي السابقة، فقدموا لي فرصة جديدة لتعلم ERPNext.</p>
          <p>خلال وقتي في شركة سالني تك، تعلمت لغة Python من خلال تدريب ERPNext. استمتعت حقًا بتجربة التعلم وأنا ممتن للفرص والمعرفة التي اكتسبتها من كل موظف في الشركة. لم أتوقف أبدًا عن التعلم، واستمريت في توسيع مهاراتي لتشمل React.js.</p>
          <p>تدربت على مشاريع مختلفة من خلال منصات مثل يوتيوب، يوديمي، كودبن وفيول. شاركت أيضًا في تجارب العمل الافتراضية من خلالمسك هاب. الآن، أنا أبحث بنشاط عن وظيفة تساعدني على تحقيق أحلامي المهنية وتوفر لي فرصًا للتعلم والنمو ومشاركة خبرتي مع فريق عمل.</p>
          <p>إذا كنت مهتمًا بالتواصل للتعاون المحتمل أو فرص عمل، يمكنك العثور على معلومات الاتصال الخاصة بي أدناه. شكرًا لوقتك، وأتطلع إلى إمكانية العمل معًا.</p>

          <a href='#contact' className='btn btn-primary'>لنتحدث</a>
        </div>
      </div>
    </section>
  );
};

export default About;